###  Part # 1
  #### Terraform Format and Style 🖌``
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:eu-north-1:915263821599:vpc/vpc-01f10124bde0f9f2e" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "192.168.201.0/24" -> "192.168.202.0/24" # forces replacement
      ~ default_network_acl_id               = "acl-012f9e1c7f9b68710" -> (known after apply)
      ~ default_route_table_id               = "rtb-005df8862a365718d" -> (known after apply)
      ~ default_security_group_id            = "sg-0af717fc3b2f392ab" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0bd07714492feef4d" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-01f10124bde0f9f2e" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-005df8862a365718d" -> (known after apply)
      ~ owner_id                             = "915263821599" -> (known after apply)
        tags                                 = {
            "Managed-by" = "Terraform"
            "Name"       = "test-vpc5"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

  ```
  </details>

  *Pusher: @pavelrn, Action: `pull_request`, Working Directory: ``, Workflow: `Infra - Dev`*